GermanBluefox/Hannah/satellite-esp/sdkconfig.defaults
# Hannah Satellite — gemeinsame Defaults (alle Targets)
# Board-spezifische Overrides:
#   sdkconfig.defaults.devkit  — ESP32-S3 DevKitC-1 (Breadboard, INMP441)
#   sdkconfig.defaults.rev3    — Hannah Satellite PCB Rev.3
#
# Build-Befehle:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.devkit" build
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.rev3"   build
#
# Gerätespezifische Werte (SSID, Passwort, Device-ID) in sdkconfig.local setzen.
# sdkconfig.local und sdkconfig sind in .gitignore.

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash & PSRAM (ESP32-S3-WROOM-1-N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Audio
CONFIG_HANNAH_AUDIO_SAMPLE_RATE=16000
CONFIG_HANNAH_AUDIO_FRAME_MS=30
CONFIG_HANNAH_VOLUME_DEFAULT=80
CONFIG_HANNAH_VOLUME_STEP=10
CONFIG_HANNAH_SPK_I2S_PORT=1

# Wake-Word (standardmäßig deaktiviert → PTT-Modus)
CONFIG_HANNAH_WAKEWORD_ENABLED=n
CONFIG_HANNAH_WAKEWORD_THRESHOLD=75
CONFIG_HANNAH_VAD_SILENCE_MS=1500
CONFIG_HANNAH_VAD_ENERGY_THRESHOLD=200
CONFIG_HANNAH_TFLITE_ARENA_KB=256

# Netzwerk
CONFIG_HANNAH_HEARTBEAT_INTERVAL_S=10
CONFIG_HANNAH_WIFI_MAX_RETRY=10
CONFIG_HANNAH_UDP_LISTEN_PORT=7776

# lwIP — UDP-Mailbox groß genug für TTS-Burst
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64

# Console über UART0 (TXD0/RXD0)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
